<?php
$title = "Роева С.М. Группа 241-352 ЛР А-1";
?>

<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title><?php echo $title; ?></title>
<link rel="stylesheet" href="style.css">
</head>

<body>

<header>

<a href="<?php
$name = "Желудь";
$link = "page1.php";
$current_page = false;
echo $link;
?>" <?php
if($current_page) echo 'class="selected_menu"';
?>><?php echo $name; ?></a>

<a href="<?php
$name = "Пипетка";
$link = "page2.php";
$current_page = false;
echo $link;
?>" <?php
if($current_page) echo 'class="selected_menu"';
?>><?php echo $name; ?></a>

<a href="<?php
$name = "Колхоз";
$link = "page3.php";
$current_page = true;
echo $link;
?>" <?php
if($current_page) echo 'class="selected_menu"';
?>><?php echo $name; ?></a>

</header>


<main>

<h1>Первая страница</h1>

<h2>Раздел 1</h2>
<?php
$stih = "Останься образом, в тумане моим компасом
Со мною пой, со мною пой ночами вполголоса
Останься образом, в тумане моим компасом
Со мною пой, со мною пой ночами вполголоса (Я)
Покидаю дождливый Ростов, мимо постов я мчу в город снов (А)
Я за тобой — ты от меня, и все двери твои на засов
Я уличный, да, но кто сказал, что нам нельзя влюбиться?
Ты домашняя вся, но мотаешься из столицы в столицу
Ты обходишь букеты, что брошены к твоим ногам так небрежно
Ты не веришь в любовь, но тем, кто в неё верит, ты даришь надежды
Вытесняя из моего сердца всех, кто грелся в нём прежде
Ты не друг и не враг, ты не явь и не сон, что-то между (Е-е)
Прошу: останься образом, в тумане моим компасом
Со мною пой, со мною пой ночами вполголоса
Останься образом, в тумане моим компасом
Со мною пой, со мною пой ночами вполголоса (А)
Покидаю дождливый Ростов, петляю, как маятник между рядов (М-м-м, а)
Впереди семь часов заправок, мостов, песен, стихов (М-м)
Городских округов, вокруг будто кино (М-м)
Тебе главная роль так идёт (М), но ты играешь её без слов (М)
Будто мне назло (М-м), может просто повезло с другим?
Может это я плачу (М-м) за все сердца, что я разбил?
Будто мне назло (М-м), может просто повезло с другим? (М-м)
Может это я плачу за все сердца, что я разбил?
Прошу: останься образом, в тумане моим компасом
Со мною пой, со мною пой ночами вполголоса
Останься образом, в тумане моим компасом
Со мною пой, со мною пой ночами вполголоса";

echo nl2br($stih);
?>

<p><?php echo nl2br($stih); ?></p>

<h2>Раздел 2</h2>

<table border="1">

<?php
echo "<tr><td>Колонка 1</td><td>Колонка 2</td><td>Колонка 3</td></tr>";
?>

<tr>
<td><?php echo "Данные 1"; ?></td>
<td><?php echo "Данные 2"; ?></td>
<td><?php echo "Данные 3"; ?></td>
</tr>

</table>

<br>

<?php
echo '<img src="fotos/foto'.(date('s') % 2 + 1).'.jpg" width="300">';
?>

</main>

<footer>
<?php
echo "Сформировано ".date('d.m.Y')." в ".date('H-i:s');
?>
</footer>

</body>
</html>
